app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2019-09-24 22:19:53.067662"], ["updated_at", "2019-09-24 22:19:53.067662"], ["artist_id", 1]]
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-09-25 00:21:48.927802"], ["updated_at", "2019-09-25 00:21:48.927802"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT ?  [["name", ".38 Special"], ["LIMIT", 1]]
---
  def upload
    CSV.foreach(params[:file].path, headers: true) do |song|
      @song = Song.create(title: song[0])
      @artist = Artist.find_or_create_by(name: song[1])